rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_EMIOS.h
#define eMIOS_MCR_GPRE_MASK                      (0xFF00U)
#define eMIOS_MCR_GPRE_SHIFT                     (8U)
#define eMIOS_MCR_GPRE_WIDTH                     (8U)
#define eMIOS_MCR_GPRE(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_MCR_GPRE_SHIFT)) & eMIOS_MCR_GPRE_MASK)

#define eMIOS_MCR_GPREN_MASK                     (0x4000000U)
#define eMIOS_MCR_GPREN_SHIFT                    (26U)
#define eMIOS_MCR_GPREN_WIDTH                    (1U)
#define eMIOS_MCR_GPREN(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_MCR_GPREN_SHIFT)) & eMIOS_MCR_GPREN_MASK)

#define eMIOS_MCR_GTBE_MASK                      (0x10000000U)
#define eMIOS_MCR_GTBE_SHIFT                     (28U)
#define eMIOS_MCR_GTBE_WIDTH                     (1U)
#define eMIOS_MCR_GTBE(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_MCR_GTBE_SHIFT)) & eMIOS_MCR_GTBE_MASK)

#define eMIOS_MCR_FRZ_MASK                       (0x20000000U)
#define eMIOS_MCR_FRZ_SHIFT                      (29U)
#define eMIOS_MCR_FRZ_WIDTH                      (1U)
#define eMIOS_MCR_FRZ(x)                         (((uint32_t)(((uint32_t)(x)) << eMIOS_MCR_FRZ_SHIFT)) & eMIOS_MCR_FRZ_MASK)

#define eMIOS_MCR_MDIS_MASK                      (0x40000000U)
#define eMIOS_MCR_MDIS_SHIFT                     (30U)
#define eMIOS_MCR_MDIS_WIDTH                     (1U)
#define eMIOS_MCR_MDIS(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_MCR_MDIS_SHIFT)) & eMIOS_MCR_MDIS_MASK)
/*! @} */

/*! @name GFLAG - Global Flag */
/*! @{ */

#define eMIOS_GFLAG_F0_MASK                      (0x1U)
#define eMIOS_GFLAG_F0_SHIFT                     (0U)
#define eMIOS_GFLAG_F0_WIDTH                     (1U)
#define eMIOS_GFLAG_F0(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F0_SHIFT)) & eMIOS_GFLAG_F0_MASK)

#define eMIOS_GFLAG_F1_MASK                      (0x2U)
#define eMIOS_GFLAG_F1_SHIFT                     (1U)
#define eMIOS_GFLAG_F1_WIDTH                     (1U)
#define eMIOS_GFLAG_F1(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F1_SHIFT)) & eMIOS_GFLAG_F1_MASK)

#define eMIOS_GFLAG_F2_MASK                      (0x4U)
#define eMIOS_GFLAG_F2_SHIFT                     (2U)
#define eMIOS_GFLAG_F2_WIDTH                     (1U)
#define eMIOS_GFLAG_F2(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F2_SHIFT)) & eMIOS_GFLAG_F2_MASK)

#define eMIOS_GFLAG_F3_MASK                      (0x8U)
#define eMIOS_GFLAG_F3_SHIFT                     (3U)
#define eMIOS_GFLAG_F3_WIDTH                     (1U)
#define eMIOS_GFLAG_F3(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F3_SHIFT)) & eMIOS_GFLAG_F3_MASK)

#define eMIOS_GFLAG_F4_MASK                      (0x10U)
#define eMIOS_GFLAG_F4_SHIFT                     (4U)
#define eMIOS_GFLAG_F4_WIDTH                     (1U)
#define eMIOS_GFLAG_F4(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F4_SHIFT)) & eMIOS_GFLAG_F4_MASK)

#define eMIOS_GFLAG_F5_MASK                      (0x20U)
#define eMIOS_GFLAG_F5_SHIFT                     (5U)
#define eMIOS_GFLAG_F5_WIDTH                     (1U)
#define eMIOS_GFLAG_F5(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F5_SHIFT)) & eMIOS_GFLAG_F5_MASK)

#define eMIOS_GFLAG_F6_MASK                      (0x40U)
#define eMIOS_GFLAG_F6_SHIFT                     (6U)
#define eMIOS_GFLAG_F6_WIDTH                     (1U)
#define eMIOS_GFLAG_F6(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F6_SHIFT)) & eMIOS_GFLAG_F6_MASK)

#define eMIOS_GFLAG_F7_MASK                      (0x80U)
#define eMIOS_GFLAG_F7_SHIFT                     (7U)
#define eMIOS_GFLAG_F7_WIDTH                     (1U)
#define eMIOS_GFLAG_F7(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F7_SHIFT)) & eMIOS_GFLAG_F7_MASK)

#define eMIOS_GFLAG_F8_MASK                      (0x100U)
#define eMIOS_GFLAG_F8_SHIFT                     (8U)
#define eMIOS_GFLAG_F8_WIDTH                     (1U)
#define eMIOS_GFLAG_F8(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F8_SHIFT)) & eMIOS_GFLAG_F8_MASK)

#define eMIOS_GFLAG_F9_MASK                      (0x200U)
#define eMIOS_GFLAG_F9_SHIFT                     (9U)
#define eMIOS_GFLAG_F9_WIDTH                     (1U)
#define eMIOS_GFLAG_F9(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F9_SHIFT)) & eMIOS_GFLAG_F9_MASK)

#define eMIOS_GFLAG_F10_MASK                     (0x400U)
#define eMIOS_GFLAG_F10_SHIFT                    (10U)
#define eMIOS_GFLAG_F10_WIDTH                    (1U)
#define eMIOS_GFLAG_F10(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F10_SHIFT)) & eMIOS_GFLAG_F10_MASK)

#define eMIOS_GFLAG_F11_MASK                     (0x800U)
#define eMIOS_GFLAG_F11_SHIFT                    (11U)
#define eMIOS_GFLAG_F11_WIDTH                    (1U)
#define eMIOS_GFLAG_F11(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F11_SHIFT)) & eMIOS_GFLAG_F11_MASK)

#define eMIOS_GFLAG_F12_MASK                     (0x1000U)
#define eMIOS_GFLAG_F12_SHIFT                    (12U)
#define eMIOS_GFLAG_F12_WIDTH                    (1U)
#define eMIOS_GFLAG_F12(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F12_SHIFT)) & eMIOS_GFLAG_F12_MASK)

#define eMIOS_GFLAG_F13_MASK                     (0x2000U)
#define eMIOS_GFLAG_F13_SHIFT                    (13U)
#define eMIOS_GFLAG_F13_WIDTH                    (1U)
#define eMIOS_GFLAG_F13(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F13_SHIFT)) & eMIOS_GFLAG_F13_MASK)

#define eMIOS_GFLAG_F14_MASK                     (0x4000U)
#define eMIOS_GFLAG_F14_SHIFT                    (14U)
#define eMIOS_GFLAG_F14_WIDTH                    (1U)
#define eMIOS_GFLAG_F14(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F14_SHIFT)) & eMIOS_GFLAG_F14_MASK)

#define eMIOS_GFLAG_F15_MASK                     (0x8000U)
#define eMIOS_GFLAG_F15_SHIFT                    (15U)
#define eMIOS_GFLAG_F15_WIDTH                    (1U)
#define eMIOS_GFLAG_F15(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F15_SHIFT)) & eMIOS_GFLAG_F15_MASK)

#define eMIOS_GFLAG_F16_MASK                     (0x10000U)
#define eMIOS_GFLAG_F16_SHIFT                    (16U)
#define eMIOS_GFLAG_F16_WIDTH                    (1U)
#define eMIOS_GFLAG_F16(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F16_SHIFT)) & eMIOS_GFLAG_F16_MASK)

#define eMIOS_GFLAG_F17_MASK                     (0x20000U)
#define eMIOS_GFLAG_F17_SHIFT                    (17U)
#define eMIOS_GFLAG_F17_WIDTH                    (1U)
#define eMIOS_GFLAG_F17(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F17_SHIFT)) & eMIOS_GFLAG_F17_MASK)

