rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_EMIOS.h
#define eMIOS_UCDIS_UCDIS10_MASK                 (0x400U)
#define eMIOS_UCDIS_UCDIS10_SHIFT                (10U)
#define eMIOS_UCDIS_UCDIS10_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS10(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS10_SHIFT)) & eMIOS_UCDIS_UCDIS10_MASK)

#define eMIOS_UCDIS_UCDIS11_MASK                 (0x800U)
#define eMIOS_UCDIS_UCDIS11_SHIFT                (11U)
#define eMIOS_UCDIS_UCDIS11_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS11(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS11_SHIFT)) & eMIOS_UCDIS_UCDIS11_MASK)

#define eMIOS_UCDIS_UCDIS12_MASK                 (0x1000U)
#define eMIOS_UCDIS_UCDIS12_SHIFT                (12U)
#define eMIOS_UCDIS_UCDIS12_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS12(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS12_SHIFT)) & eMIOS_UCDIS_UCDIS12_MASK)

#define eMIOS_UCDIS_UCDIS13_MASK                 (0x2000U)
#define eMIOS_UCDIS_UCDIS13_SHIFT                (13U)
#define eMIOS_UCDIS_UCDIS13_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS13(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS13_SHIFT)) & eMIOS_UCDIS_UCDIS13_MASK)

#define eMIOS_UCDIS_UCDIS14_MASK                 (0x4000U)
#define eMIOS_UCDIS_UCDIS14_SHIFT                (14U)
#define eMIOS_UCDIS_UCDIS14_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS14(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS14_SHIFT)) & eMIOS_UCDIS_UCDIS14_MASK)

#define eMIOS_UCDIS_UCDIS15_MASK                 (0x8000U)
#define eMIOS_UCDIS_UCDIS15_SHIFT                (15U)
#define eMIOS_UCDIS_UCDIS15_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS15(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS15_SHIFT)) & eMIOS_UCDIS_UCDIS15_MASK)

#define eMIOS_UCDIS_UCDIS16_MASK                 (0x10000U)
#define eMIOS_UCDIS_UCDIS16_SHIFT                (16U)
#define eMIOS_UCDIS_UCDIS16_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS16(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS16_SHIFT)) & eMIOS_UCDIS_UCDIS16_MASK)

#define eMIOS_UCDIS_UCDIS17_MASK                 (0x20000U)
#define eMIOS_UCDIS_UCDIS17_SHIFT                (17U)
#define eMIOS_UCDIS_UCDIS17_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS17(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS17_SHIFT)) & eMIOS_UCDIS_UCDIS17_MASK)

#define eMIOS_UCDIS_UCDIS18_MASK                 (0x40000U)
#define eMIOS_UCDIS_UCDIS18_SHIFT                (18U)
#define eMIOS_UCDIS_UCDIS18_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS18(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS18_SHIFT)) & eMIOS_UCDIS_UCDIS18_MASK)

#define eMIOS_UCDIS_UCDIS19_MASK                 (0x80000U)
#define eMIOS_UCDIS_UCDIS19_SHIFT                (19U)
#define eMIOS_UCDIS_UCDIS19_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS19(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS19_SHIFT)) & eMIOS_UCDIS_UCDIS19_MASK)

#define eMIOS_UCDIS_UCDIS20_MASK                 (0x100000U)
#define eMIOS_UCDIS_UCDIS20_SHIFT                (20U)
#define eMIOS_UCDIS_UCDIS20_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS20(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS20_SHIFT)) & eMIOS_UCDIS_UCDIS20_MASK)

#define eMIOS_UCDIS_UCDIS21_MASK                 (0x200000U)
#define eMIOS_UCDIS_UCDIS21_SHIFT                (21U)
#define eMIOS_UCDIS_UCDIS21_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS21(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS21_SHIFT)) & eMIOS_UCDIS_UCDIS21_MASK)

#define eMIOS_UCDIS_UCDIS22_MASK                 (0x400000U)
#define eMIOS_UCDIS_UCDIS22_SHIFT                (22U)
#define eMIOS_UCDIS_UCDIS22_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS22(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS22_SHIFT)) & eMIOS_UCDIS_UCDIS22_MASK)

#define eMIOS_UCDIS_UCDIS23_MASK                 (0x800000U)
#define eMIOS_UCDIS_UCDIS23_SHIFT                (23U)
#define eMIOS_UCDIS_UCDIS23_WIDTH                (1U)
#define eMIOS_UCDIS_UCDIS23(x)                   (((uint32_t)(((uint32_t)(x)) << eMIOS_UCDIS_UCDIS23_SHIFT)) & eMIOS_UCDIS_UCDIS23_MASK)
/*! @} */

/*! @name A - UC A 0..UC A 23 */
/*! @{ */

#define eMIOS_A_A_MASK                           (0xFFFFFFU)
#define eMIOS_A_A_SHIFT                          (0U)
#define eMIOS_A_A_WIDTH                          (24U)
#define eMIOS_A_A(x)                             (((uint32_t)(((uint32_t)(x)) << eMIOS_A_A_SHIFT)) & eMIOS_A_A_MASK)

#define eMIOS_A_RISE_FALL_MASK                   (0x80000000U)
#define eMIOS_A_RISE_FALL_SHIFT                  (31U)
#define eMIOS_A_RISE_FALL_WIDTH                  (1U)
#define eMIOS_A_RISE_FALL(x)                     (((uint32_t)(((uint32_t)(x)) << eMIOS_A_RISE_FALL_SHIFT)) & eMIOS_A_RISE_FALL_MASK)
/*! @} */

/*! @name B - UC B 0..UC B 23 */
/*! @{ */

#define eMIOS_B_B_MASK                           (0xFFFFFFU)
#define eMIOS_B_B_SHIFT                          (0U)
#define eMIOS_B_B_WIDTH                          (24U)
#define eMIOS_B_B(x)                             (((uint32_t)(((uint32_t)(x)) << eMIOS_B_B_SHIFT)) & eMIOS_B_B_MASK)
/*! @} */

/*! @name CNT - UC Counter 0..UC Counter 23 */
/*! @{ */

#define eMIOS_CNT_C_MASK                         (0xFFFFFFU)
#define eMIOS_CNT_C_SHIFT                        (0U)
#define eMIOS_CNT_C_WIDTH                        (24U)
#define eMIOS_CNT_C(x)                           (((uint32_t)(((uint32_t)(x)) << eMIOS_CNT_C_SHIFT)) & eMIOS_CNT_C_MASK)
/*! @} */

/*! @name C - UC Control 0..UC Control 23 */
/*! @{ */

#define eMIOS_C_MODE_MASK                        (0x7FU)
#define eMIOS_C_MODE_SHIFT                       (0U)
#define eMIOS_C_MODE_WIDTH                       (7U)
#define eMIOS_C_MODE(x)                          (((uint32_t)(((uint32_t)(x)) << eMIOS_C_MODE_SHIFT)) & eMIOS_C_MODE_MASK)

#define eMIOS_C_EDPOL_MASK                       (0x80U)
#define eMIOS_C_EDPOL_SHIFT                      (7U)
#define eMIOS_C_EDPOL_WIDTH                      (1U)
#define eMIOS_C_EDPOL(x)                         (((uint32_t)(((uint32_t)(x)) << eMIOS_C_EDPOL_SHIFT)) & eMIOS_C_EDPOL_MASK)

#define eMIOS_C_EDSEL_MASK                       (0x100U)
#define eMIOS_C_EDSEL_SHIFT                      (8U)
#define eMIOS_C_EDSEL_WIDTH                      (1U)
#define eMIOS_C_EDSEL(x)                         (((uint32_t)(((uint32_t)(x)) << eMIOS_C_EDSEL_SHIFT)) & eMIOS_C_EDSEL_MASK)

#define eMIOS_C_BSL_MASK                         (0x600U)
#define eMIOS_C_BSL_SHIFT                        (9U)
#define eMIOS_C_BSL_WIDTH                        (2U)
#define eMIOS_C_BSL(x)                           (((uint32_t)(((uint32_t)(x)) << eMIOS_C_BSL_SHIFT)) & eMIOS_C_BSL_MASK)

#define eMIOS_C_FORCMB_MASK                      (0x1000U)
#define eMIOS_C_FORCMB_SHIFT                     (12U)
#define eMIOS_C_FORCMB_WIDTH                     (1U)
#define eMIOS_C_FORCMB(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_C_FORCMB_SHIFT)) & eMIOS_C_FORCMB_MASK)

#define eMIOS_C_FORCMA_MASK                      (0x2000U)
#define eMIOS_C_FORCMA_SHIFT                     (13U)
#define eMIOS_C_FORCMA_WIDTH                     (1U)
#define eMIOS_C_FORCMA(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_C_FORCMA_SHIFT)) & eMIOS_C_FORCMA_MASK)

